#!/usr/bin/lua

-- [Doc](https://www.lua.org/manual/5.4/)

----------------------------------------------------------------------------------------------------------

-- TIPS: 变量默认全局变量, 要使用本地变量则使用local声明
-- TIPS: print打印自带tab
-- TIPS: 循环使用for var=range / for var in list

local var = 1

print("1:", var)

for var=1,10 do
  print(var)
end

----------------------------------------------------------------------------------------------------------

-- TIPS: 字符串和数字默认互相转换, 但注意格式
-- TIPS: 使用..连接数字和字符串, 连接后的结果是字符串

print(1 + 2, "1" + 2, 1 + "2")
print(1 .. 2 == '12', 1 .. 2 == 12)
print(2 + 'a', 2 .. 'a')
